Функция ПолучитьКоэфДорожныхРасходов(СкладТемп, ДатаТемп)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентыДорожныхРасходовСрезПоследних.Коэффициент КАК Коэффициент,
		|	КоэффициентыДорожныхРасходовСрезПоследних.РасчетПоТаблице КАК РасчетПоТаблице
		|ИЗ
		|	РегистрСведений.КоэффициентыДорожныхРасходов.СрезПоследних(&Период, Склад = &Склад) КАК КоэффициентыДорожныхРасходовСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ДатаТемп);
	Запрос.УстановитьПараметр("Склад", СкладТемп);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Структура;
	// По умолчанию считаем по таблице РегистрСведений.ЦенаДопРасходов,
	// если не задано в коэфициентах
	СтруктураВозврата.Вставить("Коэффициент", 0);
	СтруктураВозврата.Вставить("РасчетПоТаблице", Истина);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврата.Коэффициент   = ВыборкаДетальныеЗаписи.Коэффициент;
		СтруктураВозврата.РасчетПоТаблице		= ВыборкаДетальныеЗаписи.РасчетПоТаблице;
	КонецЕсли;
	
	Возврат  СтруктураВозврата;
	
КонецФункции	

Функция ПолучитьСтавкуЗаПресс(СкладТемп, ДатаТемп, ТипУпаковки, АдресМагазина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тп_СтавкиЗаПрессСрезПоследних.Склад КАК Склад,
		|	тп_СтавкиЗаПрессСрезПоследних.Ставка КАК СтавкаЗаПресс,
		|	тп_СтавкиЗаПрессСрезПоследних.ВалютаСтавки КАК ВалютаСтавки,
		|	0 КАК Приоритет
		|ИЗ
		|	РегистрСведений.тп_СтавкиЗаПресс.СрезПоследних(
		|			&Период,
		|			Склад = &Склад
		|				И ТипУпаковки = &ТипУпаковки
		|				И Магазин = &АдресМагазина) КАК тп_СтавкиЗаПрессСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	тп_СтавкиЗаПрессСрезПоследних.Склад,
		|	тп_СтавкиЗаПрессСрезПоследних.Ставка,
		|	тп_СтавкиЗаПрессСрезПоследних.ВалютаСтавки,
		|	1
		|ИЗ
		|	РегистрСведений.тп_СтавкиЗаПресс.СрезПоследних(
		|			&Период,
		|			Склад = &Склад
		|				И ТипУпаковки = &ТипУпаковки
		|				И Магазин = &ПустойМагазин) КАК тп_СтавкиЗаПрессСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Период", ДатаТемп);
	Запрос.УстановитьПараметр("Склад", СкладТемп);
	Запрос.УстановитьПараметр("ТипУпаковки", ТипУпаковки); 
	Запрос.УстановитьПараметр("АдресМагазина", АдресМагазина); 
	Запрос.УстановитьПараметр("ПустойМагазин", Справочники.тп_АдресаМагазинов.ПустаяСсылка());


	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтавкаЗаПресс", 0);
	СтруктураВозврата.Вставить("ВалютаСтавки", Справочники.Валюты.ПустаяСсылка());
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураВозврата.СтавкаЗаПресс = ВыборкаДетальныеЗаписи.СтавкаЗаПресс;
		СтруктураВозврата.ВалютаСтавки	= ВыборкаДетальныеЗаписи.ВалютаСтавки;
	КонецЕсли;
	
	Возврат  СтруктураВозврата;
	
КонецФункции	

Процедура РасчетДопРасходовЗаДоставку(ДанныеДляРасчета) Экспорт
	
	Если ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный 
			ИЛИ ДанныеДляРасчета.НеНачислятьДопРасход Тогда
		ДанныеДляРасчета.СуммаДопРасходовЗаДоставку = 0;
		Возврат;
	КонецЕсли;
	
	НастройкиБазы = РегистрыСведений.тп_НастройкиБазы.ПолучитьНастройкиБазы();
	
	Если ПроверкаНаличияЦеныДляКлиента(ДанныеДляРасчета) И НЕ НастройкиБазы.ОтключитьПроверкуДоговорнойПартииДляДопРасходов Тогда
		ДанныеДляРасчета.СуммаДопРасходовЗаДоставку = 0;
		Возврат	
	КонецЕсли;
	
	
	
	КоэфДорРасходов = ПолучитьКоэфДорожныхРасходов(ДанныеДляРасчета.Склад, ДанныеДляРасчета.Дата);
	
	Если ДанныеДляРасчета.ОбщийОбъем > 0 и ДанныеДляРасчета.ОбщийВес > 0 Тогда
		ДанныеДляРасчета.СреднийВес	= Окр(ДанныеДляРасчета.ОбщийВес / ДанныеДляРасчета.ОбщийОбъем, 2);
		СтруктураЦены = ПолучитьСуммуДопРасходовПоВесу(ДанныеДляРасчета, ДанныеДляРасчета.СреднийВес);
		
		Если КоэфДорРасходов.РасчетПоТаблице Тогда
			Если СтруктураЦены.ПоВесу Тогда
				ДанныеДляРасчета.СуммаДопРасходовЗаДоставку	= ДанныеДляРасчета.ОбщийВес * СтруктураЦены.Цена/1000;
			Иначе
				ДанныеДляРасчета.СуммаДопРасходовЗаДоставку	= ДанныеДляРасчета.ОбщийОбъем * СтруктураЦены.Цена;
			КонецЕсли;
			 
		Иначе
			ДанныеДляРасчета.СуммаДопРасходовЗаДоставку	= ДанныеДляРасчета.ОбщийВес * КоэфДорРасходов.Коэффициент;
			ДанныеДляРасчета.СуммаДопРасходовЗаДоставкуНазначил  = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;	
		
		Если ДанныеДляРасчета.СуммаДопРасходовЗаДоставку <> 0 Тогда
			ДанныеДляРасчета.СуммаДопРасходовЗаДоставкуНазначил  = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;	
	Иначе
		ДанныеДляРасчета.СуммаДопРасходовЗаДоставку = 0;
	КонецЕсли;
	
КонецПроцедуры	

Процедура РасчетСтавкиЗаПресс(ДанныеДляРасчета) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.АдресМагазина) Тогда
		ДанныеДляРасчета.СуммаДопРасходовЗаПресс = 0;
		ДанныеДляРасчета.ВалютаСтавкиЗаПресс     = Справочники.Валюты.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляРасчета.АдресМагазина.АдресПоставщика И ДанныеДляРасчета.КоличествоМест > 0 Тогда
		СтруктураСтавки = ПолучитьСтавкуЗаПресс(ДанныеДляРасчета.Склад, ДанныеДляРасчета.Дата, ДанныеДляРасчета.ТипУпаковки, ДанныеДляРасчета.АдресМагазина);
		ДанныеДляРасчета.СуммаДопРасходовЗаПресс = ДанныеДляРасчета.КоличествоМест * СтруктураСтавки.СтавкаЗаПресс;
		ДанныеДляРасчета.СтавкаЗаПресс =  СтруктураСтавки.СтавкаЗаПресс;
		ДанныеДляРасчета.ВалютаСтавкиЗаПресс     = СтруктураСтавки.ВалютаСтавки;
	Иначе
		ДанныеДляРасчета.СуммаДопРасходовЗаПресс = 0;
		ДанныеДляРасчета.СтавкаЗаПресс =  0;
		ДанныеДляРасчета.ВалютаСтавкиЗаПресс     = Справочники.Валюты.ПустаяСсылка();
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РасчетСреднейЦены(ДанныеДляРасчета, ЭтоКалькуляция = Ложь, ЗаполнятьТоварыПриКалькуляции = Ложь, РасчетПоНовомуДляКалькуляции = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочты Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляРасчета.ЦенаВручную ИЛИ ДанныеДляРасчета.СуммаВручную Тогда
		ОбработатьИзменениеЦеныВручную(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);
		Возврат;
	КонецЕсли;
	
	ДанныеДляРасчета.ЦенаЗаТонну	= 0;
	ДанныеДляРасчета.ЦенаЗаКуб		= 0;
	ДанныеДляРасчета.Сумма			= 0;
	
	ДанныеДляРасчета.СуммаБренд	    = 0;
	ДанныеДляРасчета.СуммаZ	        = 0;
	
	Если НЕ ЭтоКалькуляция Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
		ТаблицаТоваров.ЗаполнитьЗначения(0, "Сумма");
		ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
		
		ОбщийОбъем		= 0;
		Для Каждого текСтрока из ТаблицаТоваров Цикл
			Если не (текСтрока.ВозвратТовара или ДанныеДляРасчета.ПолныйВозврат) Тогда
				ОбщийОбъем		= ОбщийОбъем + текСтрока.объем;
			КонецЕсли;	
		КонецЦикла;
		
		ДанныеДляРасчета.ОбщийОбъем = ОбщийОбъем;
	ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары;
		ТаблицаТоваров.ЗаполнитьЗначения(0, "Сумма");
		
		ОбщийОбъем		= 0;
		Для Каждого текСтрока из ТаблицаТоваров Цикл
			Если не (текСтрока.ВозвратТовара или ДанныеДляРасчета.ПолныйВозврат) Тогда
				ОбщийОбъем		= ОбщийОбъем + текСтрока.объем;
			КонецЕсли;	
		КонецЦикла;
		
		ДанныеДляРасчета.ОбщийОбъем = ОбщийОбъем;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) и ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийВес)) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.ВидТовара) Тогда
		Возврат;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.ТипУпаковки) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) Тогда
		ДанныеДляРасчета.СреднийВес	= Окр(ДанныеДляРасчета.ОбщийВес / ДанныеДляРасчета.ОбщийОбъем,2);
	КонецЕсли;	
	
	Попытка
		ДанныеДляРасчета.ВидТарифаНаПеревозку = ПолучитьВидТарифаПеревозок(ДанныеДляРасчета.ВидОперации); 
	Исключение
	КонецПопытки;	
	
	ДанныеДляРасчета.СуммаДопРасходовЗаДоставку = 0;
	Если (НЕ ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный) 
		И (НЕ ДанныеДляРасчета.НеНачислятьДопРасход) Тогда
		РасчетСтавкиЗаПресс(ДанныеДляРасчета);
	Иначе
		ДанныеДляРасчета.СуммаДопРасходовЗаПресс = 0;
	КонецЕсли;
	
	РасчетЦенПоНовому = Константы.тп_РасчетЦенПоНовому.Получить(); 
	
	
	Если РасчетЦенПоНовому или РасчетПоНовомуДляКалькуляции Тогда
		// Перписать
		СтруктураЦенПоНовому = ПолучитьЦеныПоНовому(ДанныеДляРасчета); 
		РасчетПоНовому = СтруктураЦенПоНовому.ЦенаНаПеревозкуУстановлена И СтруктураЦенПоНовому.ЦенаНаРастаможкуУстановлена;     
		
		Если РасчетПоНовому Тогда
			РасчетСреднейЦеныПоНовому(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);
		Иначе
			РасчетДопРасходовЗаДоставку(ДанныеДляРасчета);
			РасчетСреднейЦеныПоСтарому(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);  
			// пока так
			Возврат;
		КонецЕсли;	
	Иначе
		РасчетДопРасходовЗаДоставку(ДанныеДляРасчета);
		РасчетСреднейЦеныПоСтарому(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);  
		// пока так
		Возврат;
	Конецесли;	
	
	РаспределитьСуммыПоТоварам(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);
	
КонецПроцедуры    

Процедура ПолучитьРегистраторРасчетаЦен(ДанныеДляРасчета, ЭтоКалькуляция = Ложь, ЗаполнятьТоварыПриКалькуляции = Ложь, РасчетПоНовомуДляКалькуляции = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляРасчета.Вставить("ДокументУстановкаЦен");
	
	Если ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочты Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляРасчета.ЦенаВручную ИЛИ ДанныеДляРасчета.СуммаВручную Тогда
		ОбработатьИзменениеЦеныВручную(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);
		Возврат;
	КонецЕсли;
	
	ДанныеДляРасчета.ЦенаЗаТонну	= 0;
	ДанныеДляРасчета.ЦенаЗаКуб		= 0;
	ДанныеДляРасчета.Сумма			= 0;
	
	ДанныеДляРасчета.СуммаБренд	    = 0;
	ДанныеДляРасчета.СуммаZ	        = 0;
	
	Если НЕ ЭтоКалькуляция Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
		ТаблицаТоваров.ЗаполнитьЗначения(0, "Сумма");
		ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
		
		ОбщийОбъем		= 0;
		Для Каждого текСтрока из ТаблицаТоваров Цикл
			Если не (текСтрока.ВозвратТовара или ДанныеДляРасчета.ПолныйВозврат) Тогда
				ОбщийОбъем		= ОбщийОбъем + текСтрока.объем;
			КонецЕсли;	
		КонецЦикла;
		
		ДанныеДляРасчета.ОбщийОбъем = ОбщийОбъем;
	ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары;
		ТаблицаТоваров.ЗаполнитьЗначения(0, "Сумма");
		
		ОбщийОбъем		= 0;
		Для Каждого текСтрока из ТаблицаТоваров Цикл
			Если не (текСтрока.ВозвратТовара или ДанныеДляРасчета.ПолныйВозврат) Тогда
				ОбщийОбъем		= ОбщийОбъем + текСтрока.объем;
			КонецЕсли;	
		КонецЦикла;
		
		ДанныеДляРасчета.ОбщийОбъем = ОбщийОбъем;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) и ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийВес)) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.ВидТовара) Тогда
		Возврат;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.ТипУпаковки) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) Тогда
		ДанныеДляРасчета.СреднийВес	= Окр(ДанныеДляРасчета.ОбщийВес / ДанныеДляРасчета.ОбщийОбъем,2);
	КонецЕсли;	
	
	Попытка
		ДанныеДляРасчета.ВидТарифаНаПеревозку = ПолучитьВидТарифаПеревозок(ДанныеДляРасчета.ВидОперации); 
	Исключение
	КонецПопытки;	
	
	ДанныеДляРасчета.СуммаДопРасходовЗаДоставку = 0;
	Если (НЕ ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный) 
		И (НЕ ДанныеДляРасчета.НеНачислятьДопРасход) Тогда
		РасчетСтавкиЗаПресс(ДанныеДляРасчета);
	Иначе
		ДанныеДляРасчета.СуммаДопРасходовЗаПресс = 0;
	КонецЕсли;
	
	РасчетЦенПоНовому = Константы.тп_РасчетЦенПоНовому.Получить(); 
	
	
	Если РасчетЦенПоНовому или РасчетПоНовомуДляКалькуляции Тогда
		// Перписать
		СтруктураЦенПоНовому = ПолучитьЦеныПоНовому(ДанныеДляРасчета); 
		РасчетПоНовому = СтруктураЦенПоНовому.ЦенаНаПеревозкуУстановлена И СтруктураЦенПоНовому.ЦенаНаРастаможкуУстановлена;     
		
		Если РасчетПоНовому Тогда
			РасчетСреднейЦеныПоНовому(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);
		Иначе
			РасчетДопРасходовЗаДоставку(ДанныеДляРасчета);
			РасчетСреднейЦеныПоСтарому(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);  
			// пока так
			Возврат;
		КонецЕсли;	
	Иначе
		РасчетДопРасходовЗаДоставку(ДанныеДляРасчета);
		РасчетСреднейЦеныПоСтарому(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);  
		// пока так
		Возврат;
	Конецесли;	
	
	РаспределитьСуммыПоТоварам(ДанныеДляРасчета, ЭтоКалькуляция, ЗаполнятьТоварыПриКалькуляции);
	
КонецПроцедуры    


функция ПроверкаНаличияЦеныДляКлиента(ДанныеДляРасчета)
    	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Приоритет,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Цена КАК Цена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЭкспрессЦена КАК ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ПоВесу КАК ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаАвиа КАК ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.АвиаПоОбъему КАК АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБренд КАК ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаZ КАК ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБрендАвиа КАК ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Период КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка) КАК Склад
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоВидамТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И видТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &Склад) КАК ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Цена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка)
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоВидамТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И видТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &ПустойСклад) КАК ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Цена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка)
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоГруппамВидовТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И Группа = &ГруппаВидаТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &Склад) КАК ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Цена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка)
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоГруппамВидовТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И Группа = &ГруппаВидаТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &ПустойСклад) КАК ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ВидТовара", ДанныеДляРасчета.ВидТовара);
	Запрос.УстановитьПараметр("ГруппаВидаТовара", ДанныеДляРасчета.ВидТовара.Родитель);
	Запрос.УстановитьПараметр("Клиент", ДанныеДляРасчета.Клиент);
	Запрос.УстановитьПараметр("Период", ДанныеДляРасчета.Дата);
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.тп_Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("Склад", ДанныеДляРасчета.Склад);
	Запрос.УстановитьПараметр("СреднийВес", ДанныеДляРасчета.СреднийВес);
	Запрос.УстановитьПараметр("ТипУпаковки", ДанныеДляРасчета.ТипУпаковки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой() 

	
		
КонецФункции

Процедура РасчетСреднейЦеныПоСтарому(ДанныеДляРасчета, ЭтоКалькуляция = Ложь, ЗаполнятьТоварыПриКалькуляции = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьЦеныДляСклада = ЕстьЦеныДляСклада(ДанныеДляРасчета.Склад);
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Приоритет,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Цена КАК Цена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЭкспрессЦена КАК ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ПоВесу КАК ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаАвиа КАК ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.АвиаПоОбъему КАК АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБренд КАК ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаZ КАК ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБрендАвиа КАК ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Период КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка) КАК Склад,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоВидамТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И видТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &Склад) КАК ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Цена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка),
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоВидамТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И видТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &ПустойСклад) КАК ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Цена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка),
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоГруппамВидовТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И Группа = &ГруппаВидаТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &Склад) КАК ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Цена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка),
		|	ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоГруппамВидовТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И Группа = &ГруппаВидаТовара
		|				И ТипУпаковки = &ТипУпаковки
		|				И Склад = &ПустойСклад) КАК ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоГруппамВидовТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	ЦеныНаГрузСрезПоследних.Цена,
		|	ЦеныНаГрузСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузСрезПоследних.ПоВесу,
		|	ЦеныНаГрузСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузСрезПоследних.Период,
		|	ЦеныНаГрузСрезПоследних.Склад,
		|	ЦеныНаГрузСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузПоВидамТовара.СрезПоследних(
		|			&Период,
		|			Склад = &Склад
		|				И ВидТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки) КАК ЦеныНаГрузСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузСрезПоследних.ВесОт И ЦеныНаГрузСрезПоследних.ВесДо
		|	И ЦеныНаГрузСрезПоследних.Используется = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5,
		|	ЦеныНаГрузСрезПоследних.Цена,
		|	ЦеныНаГрузСрезПоследних.ЭкспрессЦена,
		|	ЦеныНаГрузСрезПоследних.ПоВесу,
		|	ЦеныНаГрузСрезПоследних.ЦенаАвиа,
		|	ЦеныНаГрузСрезПоследних.АвиаПоОбъему,
		|	ЦеныНаГрузСрезПоследних.ЦенаБренд,
		|	ЦеныНаГрузСрезПоследних.ЦенаZ,
		|	ЦеныНаГрузСрезПоследних.ЦенаБрендАвиа,
		|	ЦеныНаГрузСрезПоследних.Период,
		|	ЦеныНаГрузСрезПоследних.Склад,
		|	ЦеныНаГрузСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузПоВидамТовара.СрезПоследних(
		|			&Период,
		|			Склад = &ПустойСклад
		|				И ВидТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки) КАК ЦеныНаГрузСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузСрезПоследних.ВесОт И ЦеныНаГрузСрезПоследних.ВесДо
		|	И ЦеныНаГрузСрезПоследних.Используется = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	Период УБЫВ";
		
	//КонецЕсли;	
	
	Запрос.УстановитьПараметр("СреднийВес", 	ДанныеДляРасчета.СреднийВес);
	Запрос.УстановитьПараметр("Склад", 			ДанныеДляРасчета.Склад);
	Запрос.УстановитьПараметр("ПустойСклад", 	Справочники.тп_Склады.ПустаяСсылка());

	Запрос.УстановитьПараметр("ВидТовара", 		ДанныеДляРасчета.ВидТовара);
	Запрос.УстановитьПараметр("ГруппаВидаТовара", ДанныеДляРасчета.ВидТовара.Родитель);
	
	Запрос.УстановитьПараметр("ТипУпаковки", 	ДанныеДляРасчета.ТипУпаковки);
	Запрос.УстановитьПараметр("Период", 		КонецДня(ДанныеДляРасчета.Дата));
	
	Попытка
		Клиент = ДанныеДляРасчета.Клиент;
	Исключение
		Клиент = Справочники.тп_Клиенты.ПустаяСсылка();
	КонецПопытки;	
	
	Запрос.УстановитьПараметр("Клиент",	Клиент);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НастройкиРасчетаШК = ПолучитьНастройкиРасчетаШК(ДанныеДляРасчета.Дата);
	
	РасчетАвиа = НастройкиРасчетаШК.РасчетАвиа;
	РасчетБренд = НастройкиРасчетаШК.РасчетБренд;
	РасчетZТовар = НастройкиРасчетаШК.РасчетZТовар;
	РасчетЭкспресс = НастройкиРасчетаШК.РасчетЭкспресс;
	РасчетДорогогоТовара = НастройкиРасчетаШК.РасчетДорогогоТовара;
	
	НаценкаЗаБренд = тп_Служебный.ПолучитьНаценкуЗаБренд(ДанныеДляРасчета.Дата);
	
	ТолькоСвоиЦены = ДанныеДляРасчета.Склад.ТолькоСвоиЦены;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ТолькоСвоиЦены И (НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Склад)) Тогда
			// не рассчитывать по этому регистру
		Иначе
			// Расчет
			Если ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный 
				И РасчетАвиа Тогда
				Если НЕ ВыборкаДетальныеЗаписи.АвиаПоОбъему Тогда
					ДанныеДляРасчета.ЦенаЗаТонну	= ВыборкаДетальныеЗаписи.ЦенаАвиа;
					// Основная цена и сумма
					ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.ОбщийВес / 1000 * ДанныеДляРасчета.ЦенаЗаТонну;
					ДанныеДляРасчета.ЦенаЗаКуб	= ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийОбъем; 
					// Добавим сумму за бренд
					Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда
						СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
						ДанныеДляРасчета.СуммаБренд	= ПолучитьСуммуБренд(СтруктураПараметровТемп);
					КонецЕсли;
					
					Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
						СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
						ДанныеДляРасчета.СуммаZ	= ПолучитьСуммуZ(СтруктураПараметровТемп);
					КонецЕсли;
					
					ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаБренд + ДанныеДляРасчета.СуммаZ;
					ДанныеДляРасчета.ПоВесу = Истина;
				Иначе
					ДанныеДляРасчета.ЦенаЗаКуб	= ВыборкаДетальныеЗаписи.ЦенаАвиа;
					// Основная цена и сумма
					ДанныеДляРасчета.Сумма	= ДанныеДляРасчета.ОбщийОбъем * ДанныеДляРасчета.ЦенаЗаКуб;
					ДанныеДляРасчета.ЦенаЗаТонну = (ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийВес) * 1000; 
					// Добавим сумму за бренд
					Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда
						СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
						ДанныеДляРасчета.СуммаБренд	= ПолучитьСуммуБренд(СтруктураПараметровТемп);
					КонецЕсли;
					Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
						СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
						ДанныеДляРасчета.СуммаZ	= ПолучитьСуммуZ(СтруктураПараметровТемп);
					КонецЕсли;
					
					ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаБренд + ДанныеДляРасчета.СуммаZ;
					ДанныеДляРасчета.ПоВесу = Ложь;
				КонецЕсли;
				
				ДанныеДляРасчета.ЦенаПоОсновномуРегистру = Истина;
				
			Иначе
				Если ВыборкаДетальныеЗаписи.ПоВесу Тогда
					Если ДанныеДляРасчета.ЭкспрессДоставка И РасчетЭкспресс Тогда
						ДанныеДляРасчета.ЦенаЗаТонну	= ВыборкаДетальныеЗаписи.ЭкспрессЦена;
					ИНаче
						ДанныеДляРасчета.ЦенаЗаТонну	= ВыборкаДетальныеЗаписи.Цена;
					КонецЕсли;
					ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.ОбщийВес / 1000 * ДанныеДляРасчета.ЦенаЗаТонну;
					ДанныеДляРасчета.ЦенаЗаКуб	= ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийОбъем; 
					ДанныеДляРасчета.ПоВесу = Истина;
				Иначе
					Если ДанныеДляРасчета.ЭкспрессДоставка И РасчетЭкспресс Тогда
						ДанныеДляРасчета.ЦенаЗаКуб	= ВыборкаДетальныеЗаписи.ЭкспрессЦена;
					ИНаче
						ДанныеДляРасчета.ЦенаЗаКуб	= ВыборкаДетальныеЗаписи.Цена;
					КонецЕсли; 
					//ilhom 03022026
					Если ДанныеДляРасчета.Свойство("ДокументУстановкаЦен") Тогда
						МассивДокументов = Новый Массив();	
						МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Регистратор);	
						ДанныеДляРасчета.ДокументУстановкаЦен = МассивДокументов;
					КонецЕсли;					
					//ilhom
					ДанныеДляРасчета.Сумма	= ДанныеДляРасчета.ОбщийОбъем * ДанныеДляРасчета.ЦенаЗаКуб;
					ДанныеДляРасчета.ЦенаЗаТонну = (ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийВес) * 1000; 
					ДанныеДляРасчета.ПоВесу = Ложь;
				КонецЕсли;
				
				Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда
					СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
					ДанныеДляРасчета.СуммаБренд	= ПолучитьСуммуБренд(СтруктураПараметровТемп);
					ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаБренд;
				КонецЕсли;
				Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
					СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
					ДанныеДляРасчета.СуммаZ	= ПолучитьСуммуZ(СтруктураПараметровТемп);
					ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаZ;
				КонецЕсли;
				
				ДанныеДляРасчета.ЦенаПоОсновномуРегистру = Истина;
				
			КонецЕсли;	
			
			// Распределение сумм
			Если НЕ ЭтоКалькуляция Тогда
				ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
				Если ДанныеДляРасчета.ПоВесу Тогда
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
					ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
				Иначе	
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
					ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
				КонецЕсли;	
				МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);
				
				ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
				
				Если ДанныеДляРасчета.СуммаБренд <> 0 Тогда
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
					МассивСуммБренд = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаБренд, МассивКоэф, 2);
					ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммБренд, "СуммаБренд");
				КонецЕсли;
				
				Если ДанныеДляРасчета.СуммаZ <> 0 Тогда
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
					МассивСуммZ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаZ, МассивКоэф, 2);
					ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммZ, "СуммаZ");
				КонецЕсли;
				
				ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
			ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
				ТаблицаТоваров = ДанныеДляРасчета.Товары;
				Если ДанныеДляРасчета.ПоВесу Тогда
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
					ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
				Иначе	
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
					ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
				КонецЕсли;	
				МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);
				
				ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
				
				Если ДанныеДляРасчета.СуммаБренд <> 0 Тогда
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
					МассивСуммБренд = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаБренд, МассивКоэф, 2);
					ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммБренд, "СуммаБренд");
				КонецЕсли;
				
				Если ДанныеДляРасчета.СуммаZ <> 0 Тогда
					МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
					МассивСуммZ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаZ, МассивКоэф, 2);
					ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммZ, "СуммаZ");
				КонецЕсли;
				
			КонецЕсли;	
			Возврат;
			
		КонецЕсли;	
	КонецЕсли;

	// Если нет цены по виду товара
	Запрос 	= Новый Запрос;
	Запрос.Текст	= 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	ЦенаНаГрузСрезПоследних.МинВес КАК МинВес,
	|	ЦенаНаГрузСрезПоследних.МаксВес КАК МаксВес,
	|	ЦенаНаГрузСрезПоследних.СрокДействия КАК СрокДействия,
	|	ЦенаНаГрузСрезПоследних.Цена КАК Цена,
	|	ЦенаНаГрузСрезПоследних.ЭкспрессЦена КАК ЭкспрессЦена,
	|	ЦенаНаГрузСрезПоследних.ПоВесу КАК ПоВесу,
	|	ЦенаНаГрузСрезПоследних.ЦенаАвиа КАК ЦенаАвиа,
	|	ЦенаНаГрузСрезПоследних.АвиаПоОбъему КАК АвиаПоОбъему,
	|	ЦенаНаГрузСрезПоследних.Период КАК Период,
	|	ЦенаНаГрузСрезПоследних.ЦенаБренд КАК ЦенаБренд,
	|	ЦенаНаГрузСрезПоследних.ЦенаZ КАК ЦенаZ,
	|	ЦенаНаГрузСрезПоследних.ЦенаБрендАвиа КАК ЦенаБрендАвиа,
	|	ЦенаНаГрузСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ЦеныНаГруз.СрезПоследних(&КонецПериода, ) КАК ЦенаНаГрузСрезПоследних
	|ГДЕ
	|	&СреднийВес МЕЖДУ ЦенаНаГрузСрезПоследних.МинВес И ЦенаНаГрузСрезПоследних.МаксВес
	|	И (ЦенаНаГрузСрезПоследних.СрокДействия >= &КонецПериода
	|			ИЛИ ЦенаНаГрузСрезПоследних.СрокДействия = &ПустаяДата)
	|	И ЦенаНаГрузСрезПоследних.Склад = &Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЦенаНаГрузСрезПоследних.МинВес,
	|	ЦенаНаГрузСрезПоследних.МаксВес,
	|	ЦенаНаГрузСрезПоследних.СрокДействия,
	|	ЦенаНаГрузСрезПоследних.Цена,
	|	ЦенаНаГрузСрезПоследних.ЭкспрессЦена,
	|	ЦенаНаГрузСрезПоследних.ПоВесу,
	|	ЦенаНаГрузСрезПоследних.ЦенаАвиа,
	|	ЦенаНаГрузСрезПоследних.АвиаПоОбъему,
	|	ЦенаНаГрузСрезПоследних.Период,
	|	ЦенаНаГрузСрезПоследних.ЦенаБренд,
	|	ЦенаНаГрузСрезПоследних.ЦенаZ,
	|	ЦенаНаГрузСрезПоследних.ЦенаБрендАвиа,
	|	ЦенаНаГрузСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.ЦеныНаГруз.СрезПоследних(&КонецПериода, ) КАК ЦенаНаГрузСрезПоследних
	|ГДЕ
	|	&СреднийВес МЕЖДУ ЦенаНаГрузСрезПоследних.МинВес И ЦенаНаГрузСрезПоследних.МаксВес
	|	И (ЦенаНаГрузСрезПоследних.СрокДействия >= &КонецПериода
	|			ИЛИ ЦенаНаГрузСрезПоследних.СрокДействия = &ПустаяДата)
	|	И ЦенаНаГрузСрезПоследних.Склад = &ПустойСклад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("СреднийВес", ДанныеДляРасчета.СреднийВес);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДанныеДляРасчета.Дата));
	ЗАпрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	Запрос.УстановитьПараметр("Склад", 			ДанныеДляРасчета.Склад);
	Запрос.УстановитьПараметр("ПустойСклад", 	Справочники.тп_Склады.ПустаяСсылка());
	
	//Запрос.УстановитьПараметр("Префикс", 		Строка(Константы.СкладУстановкиЦен.Получить().ПрефиксСклада));
	ВыборкаДетальныеЗаписи	= Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		// Расчет
		Если ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный 
			И РасчетАвиа Тогда
			Если НЕ ВыборкаДетальныеЗаписи.АвиаПоОбъему Тогда
				ДанныеДляРасчета.ЦенаЗаТонну	= ВыборкаДетальныеЗаписи.ЦенаАвиа;
				ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.ОбщийВес / 1000 * ДанныеДляРасчета.ЦенаЗаТонну;
				ДанныеДляРасчета.ЦенаЗаКуб	= ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийОбъем; 
				
				// Добавим сумму за бренд
				Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда
					СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
					ДанныеДляРасчета.СуммаБренд	= ПолучитьСуммуБренд(СтруктураПараметровТемп);
				КонецЕсли;
				Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
					СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
					ДанныеДляРасчета.СуммаZ	= ПолучитьСуммуZ(СтруктураПараметровТемп);
				КонецЕсли;
				ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаБренд + ДанныеДляРасчета.СуммаZ;
				ДанныеДляРасчета.ПоВесу = Истина;
			Иначе
				ДанныеДляРасчета.ЦенаЗаКуб	= ВыборкаДетальныеЗаписи.ЦенаАвиа;
				//ilhom 03022026
				Если ДанныеДляРасчета.Свойство("ДокументУстановкаЦен") Тогда
					МассивДокументов = Новый Массив();	
					МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Регистратор);	
					ДанныеДляРасчета.ДокументУстановкаЦен = МассивДокументов;
				КонецЕсли;					
				//ilhom
				ДанныеДляРасчета.Сумма	= ДанныеДляРасчета.ОбщийОбъем * ДанныеДляРасчета.ЦенаЗаКуб;
				ДанныеДляРасчета.ЦенаЗаТонну = (ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийВес) * 1000; 
				// Добавим сумму за бренд
				Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда
					СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
					ДанныеДляРасчета.СуммаБренд	= ПолучитьСуммуБренд(СтруктураПараметровТемп);
				КонецЕсли;
				Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
					СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
					ДанныеДляРасчета.СуммаZ	= ПолучитьСуммуZ(СтруктураПараметровТемп);
				КонецЕсли;
				ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаБренд + ДанныеДляРасчета.СуммаZ;

				ДанныеДляРасчета.ПоВесу = Ложь;
			КонецЕсли;
			ДанныеДляРасчета.ЦенаПоОсновномуРегистру = Ложь;
		Иначе
			Если ВыборкаДетальныеЗаписи.ПоВесу Тогда
				Если ДанныеДляРасчета.ЭкспрессДоставка И РасчетЭкспресс Тогда
					ДанныеДляРасчета.ЦенаЗаТонну	= ВыборкаДетальныеЗаписи.ЭкспрессЦена;
				ИНаче
					ДанныеДляРасчета.ЦенаЗаТонну	= ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.ОбщийВес / 1000 * ДанныеДляРасчета.ЦенаЗаТонну;
				ДанныеДляРасчета.ЦенаЗаКуб	= ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийОбъем; 
				ДанныеДляРасчета.ПоВесу = Истина;
				
			Иначе
				Если ДанныеДляРасчета.ЭкспрессДоставка И РасчетЭкспресс Тогда
					ДанныеДляРасчета.ЦенаЗаКуб	= ВыборкаДетальныеЗаписи.ЭкспрессЦена;
				Иначе
					ДанныеДляРасчета.ЦенаЗаКуб	= ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				//ilhom 03022026
				Если ДанныеДляРасчета.Свойство("ДокументУстановкаЦен") Тогда
					МассивДокументов = Новый Массив();	
						МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Регистратор);	
						ДанныеДляРасчета.ДокументУстановкаЦен = МассивДокументов;
				КонецЕсли;					
				//ilhom
				ДанныеДляРасчета.Сумма	= ДанныеДляРасчета.ОбщийОбъем * ДанныеДляРасчета.ЦенаЗаКуб;
				ДанныеДляРасчета.ЦенаЗаТонну = (ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийВес) * 1000; 
				ДанныеДляРасчета.ПоВесу = Ложь;
			КонецЕсли;
			Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда
				СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
				ДанныеДляРасчета.СуммаБренд	= ПолучитьСуммуБренд(СтруктураПараметровТемп);
				ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаБренд;
			КонецЕсли;
			Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
				СтруктураПараметровТемп = ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи);
				ДанныеДляРасчета.СуммаZ	= ПолучитьСуммуZ(СтруктураПараметровТемп);
				ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.Сумма + ДанныеДляРасчета.СуммаZ;
			КонецЕсли;
			ДанныеДляРасчета.ЦенаПоОсновномуРегистру = Ложь;
			
		КонецЕсли;	
		
		// Распределение сумм
		Если НЕ ЭтоКалькуляция Тогда
			ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
			Если ДанныеДляРасчета.ПоВесу Тогда
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
				ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
			Иначе	
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
				ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
			КонецЕсли;	
			МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);
			
			ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
			
			Если ДанныеДляРасчета.СуммаБренд <> 0 Тогда
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
				МассивСуммБренд = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаБренд, МассивКоэф, 2);
				ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммБренд, "СуммаБренд");
			КонецЕсли;
			Если ДанныеДляРасчета.СуммаZ <> 0 Тогда
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
				МассивСуммZ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаZ, МассивКоэф, 2);
				ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммZ, "СуммаZ");
			КонецЕсли;
			
			ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
		ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
			ТаблицаТоваров = ДанныеДляРасчета.Товары;
			Если ДанныеДляРасчета.ПоВесу Тогда
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
				ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
			Иначе	
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
				ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
			КонецЕсли;	
			МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);
			
			ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
			
			Если ДанныеДляРасчета.СуммаБренд <> 0 Тогда
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
				МассивСуммБренд = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаБренд, МассивКоэф, 2);
				ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммБренд, "СуммаБренд");
			КонецЕсли;
			Если ДанныеДляРасчета.СуммаZ <> 0 Тогда
				МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
				МассивСуммZ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаZ, МассивКоэф, 2);
				ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммZ, "СуммаZ");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетСреднейЦеныПоНовому(ДанныеДляРасчета, ЭтоКалькуляция = Ложь, ЗаполнятьТоварыПриКалькуляции = Ложь) Экспорт
	// Вставить содержимое метода.
	УстановитьПривилегированныйРежим(Истина);
	
	
	ЕстьЦеныДляСклада = ЕстьЦеныДляСклада(ДанныеДляРасчета.Склад);
	
	ЦеныКлиента = ПолучитьЦеныДляКлиента(ДанныеДляРасчета); 
	Если ЦеныКлиента.ЦенаУстановлена Тогда
		
	КонецЕсли;	
	
	СтруктураЦенПоНовому = ПолучитьЦеныПоНовому(ДанныеДляРасчета); 
	
	РасчетПоНовому = СтруктураЦенПоНовому.ЦенаНаПеревозкуУстановлена И СтруктураЦенПоНовому.ЦенаНаРастаможкуУстановлена;
	Если НЕ РасчетПоНовому Тогда
		Возврат;
	КонецЕсли;	
	
	//ilhom 03022026
	Если ДанныеДляРасчета.Свойство("ДокументУстановкаЦен") Тогда
		МассивДокументов = Новый Массив();                                            
		Если ЗначениеЗаполнено(СтруктураЦенПоНовому.ЦенаНаРастаможку.Регистратор) Тогда
			МассивДокументов.Добавить(СтруктураЦенПоНовому.ЦенаНаРастаможку.Регистратор);
		КонецЕсли; 
		ДанныеДляРасчета.ДокументУстановкаЦен = МассивДокументов;
	КонецЕсли;
	//ilhom
	
	СуммаЗаПеревозку = 0;  
	СуммаРастаможки  = 0;
	СуммаНаценок	 = 0;
	
	// Расчет растаможки 
	ЦенаНаРастаможку = СтруктураЦенПоНовому.ЦенаНаРастаможку;
	
	Если ЦенаНаРастаможку.ПоВесу Тогда
		СуммаРастаможки = ДанныеДляРасчета.ОбщийВес / 1000 * ЦенаНаРастаможку.Цена;
	ИначеЕсли ЦенаНаРастаможку.ПоКоличеству Тогда
		СуммаРастаможки = (ДанныеДляРасчета.КоличествоМест * ДанныеДляРасчета.КоличествоВУпаковке) * ЦенаНаРастаможку.Цена;
	Иначе
		СуммаРастаможки = ДанныеДляРасчета.ОбщийОбъем * ЦенаНаРастаможку.Цена;
	КонецЕсли;
	
	// Расчет перевозки 
	ТарифНаПеревозку = СтруктураЦенПоНовому.ТарифНаПеревозку;
	
	Если СтруктураЦенПоНовому.ЛогистикаВключена Тогда
		СуммаЗаПеревозку = 0;
	Иначе
		Если ТарифНаПеревозку.ПоВесу Тогда
			СуммаЗаПеревозку = ДанныеДляРасчета.ОбщийВес / 1000 * ТарифНаПеревозку.Цена;
			ДанныеДляРасчета.ПоВесу = Истина;
		Иначе
			СуммаЗаПеревозку = ДанныеДляРасчета.ОбщийОбъем * ТарифНаПеревозку.Цена;
			ДанныеДляРасчета.ПоВесу = Ложь;
		КонецЕсли;
	КонецЕсли;     
	
	// Расчет наценок (бренд и т.д)    
	Если СтруктураЦенПоНовому.НаценкиУстановлены Тогда
		ТаблицаНаценок = СтруктураЦенПоНовому.НаценкиНаТовар;
		
		НастройкиРасчетаШК = ПолучитьНастройкиРасчетаШК(ДанныеДляРасчета.Дата);
		РасчетБренд = НастройкиРасчетаШК.РасчетБренд;
		РасчетZТовар = НастройкиРасчетаШК.РасчетZТовар;
		
		ЭтоАвиа = ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный;
		
		СуммаБренд = 0;
		Если ДанныеДляРасчета.Брэнд И РасчетБренд Тогда         
			СтрокаБренд = ТаблицаНаценок.Найти(Справочники.тп_ВидыНаценокЗаТовар.Бренд, "ВидНаценки");
			
			Если НЕ СтрокаБренд = Неопределено Тогда
				Если ЭтоАвиа Тогда  // Только если авиа 
					СуммаБренд	= ДанныеДляРасчета.ОбщийВес * СтрокаБренд.Наценка;
				Иначе
					СуммаБренд	= ДанныеДляРасчета.ОбщийОбъем * СтрокаБренд.Наценка;
				КонецЕсли;
			КонецЕсли;	 
			
			СуммаНаценок = СуммаНаценок + СуммаБренд; 
		КонецЕсли;
		ДанныеДляРасчета.СуммаБренд = СуммаБренд;
		
		СуммаZ = 0;
		Если ДанныеДляРасчета.ZТовар И РасчетZТовар Тогда
			
			СтрокаZ = ТаблицаНаценок.Найти(Справочники.тп_ВидыНаценокЗаТовар.Батарея, "ВидНаценки");
			
			Если НЕ СтрокаZ = Неопределено Тогда
				СуммаZ	= ДанныеДляРасчета.ОбщийОбъем * СтрокаZ.Наценка;
			КонецЕсли;	 
			
			СуммаНаценок = СуммаНаценок + СуммаZ; 
			
		КонецЕсли;
		ДанныеДляРасчета.СуммаZ = СуммаZ;
	КонецЕсли;
	
	ДанныеДляРасчета.Сумма = СуммаЗаПеревозку + СуммаРастаможки + СуммаНаценок; 
	
	ДанныеДляРасчета.СуммаЗаПеревозку = СуммаЗаПеревозку;
	ДанныеДляРасчета.СуммаЗаРастаможку = СуммаРастаможки;
	
	ДанныеДляРасчета.ЦенаЗаТонну = (ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийВес) * 1000; 
	ДанныеДляРасчета.ЦенаЗаКуб	= ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийОбъем; 
	
	ДанныеДляРасчета.ЦенаПоОсновномуРегистру = Истина;
	
КонецПроцедуры


Процедура ОбработатьИзменениеЦеныВручную(ДанныеДляРасчета, ЭтоКалькуляция = Ложь, ЗаполнятьТоварыПриКалькуляции = Ложь)
	
	ДанныеДляРасчета.СуммаБренд	    = 0;
	
	Если НЕ ДанныеДляРасчета.СуммаВручную Тогда
		Если ДанныеДляРасчета.ПоВесу Тогда
			ДанныеДляРасчета.Сумма		= ДанныеДляРасчета.ОбщийВес / 1000 * ДанныеДляРасчета.ЦенаЗаТонну;
			ДанныеДляРасчета.ЦенаЗаКуб	= ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийОбъем; 
		Иначе
			ДанныеДляРасчета.Сумма	= ДанныеДляРасчета.ОбщийОбъем * ДанныеДляРасчета.ЦенаЗаКуб;
			ДанныеДляРасчета.ЦенаЗаТонну = (ДанныеДляРасчета.Сумма / ДанныеДляРасчета.ОбщийВес) * 1000; 
		КонецЕсли;	
	КонецЕсли;	

	Если НЕ ЭтоКалькуляция Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
		ТаблицаТоваров.ЗаполнитьЗначения(0, "Сумма");
		ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
		
		ОбщийОбъем		= 0;
		Для Каждого текСтрока из ТаблицаТоваров Цикл
			Если не (текСтрока.ВозвратТовара или ДанныеДляРасчета.ПолныйВозврат) Тогда
				ОбщийОбъем		= ОбщийОбъем + текСтрока.объем;
			КонецЕсли;	
		КонецЦикла;
		
		ДанныеДляРасчета.ОбщийОбъем = ОбщийОбъем;
	ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары;
		ТаблицаТоваров.ЗаполнитьЗначения(0, "Сумма");
		
		ОбщийОбъем		= 0;
		Для Каждого текСтрока из ТаблицаТоваров Цикл
			Если не (текСтрока.ВозвратТовара или ДанныеДляРасчета.ПолныйВозврат) Тогда
				ОбщийОбъем		= ОбщийОбъем + текСтрока.объем;
			КонецЕсли;	
		КонецЦикла;
		
		ДанныеДляРасчета.ОбщийОбъем = ОбщийОбъем;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) и ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийВес)) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.ВидТовара) Тогда
		Возврат;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ДанныеДляРасчета.ТипУпаковки) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) Тогда
		ДанныеДляРасчета.СреднийВес	= Окр(ДанныеДляРасчета.ОбщийВес / ДанныеДляРасчета.ОбщийОбъем,2);
	КонецЕсли;	
	
	Если (НЕ ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный) 
		И (НЕ ДанныеДляРасчета.НеНачислятьДопРасход) Тогда
		РасчетДопРасходовЗаДоставку(ДанныеДляРасчета);
	Иначе
		ДанныеДляРасчета.СуммаДопРасходовЗаДоставку = 0;
	КонецЕсли;
	
	Если НЕ ЭтоКалькуляция Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
	ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляРасчета.ПоВесу Тогда
		МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
		ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
	Иначе	
		МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
		ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
	КонецЕсли;	
	МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);
			
	ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
	Если НЕ ЭтоКалькуляция Тогда
		ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
	ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
	КонецЕсли;
	
	
КонецПроцедуры	

Функция ПолучитьСуммуДопРасходовПоВесу(ДанныеОбъекта, ВесПриемкиСредний) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦенаДопРасходовСрезПоследних.МинВес,
		|	ЦенаДопРасходовСрезПоследних.МаксВес,
		|	ЦенаДопРасходовСрезПоследних.ПоВесу,
		|	ЦенаДопРасходовСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦенаДопРасходов.СрезПоследних(&Дата, Склад = &Склад) КАК ЦенаДопРасходовСрезПоследних
		|ГДЕ
		|	ЦенаДопРасходовСрезПоследних.МинВес <= &ВесПриемкиОбщий
		|	И ЦенаДопРасходовСрезПоследних.МаксВес >= &ВесПриемкиОбщий
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";

	Запрос.УстановитьПараметр("Дата", ДанныеОбъекта.Дата);
	Запрос.УстановитьПараметр("ВесПриемкиОбщий", ВесПриемкиСредний);
	Запрос.УстановитьПараметр("Склад", ДанныеОбъекта.Склад);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Цена", 0);
	СтруктураВозврата.Вставить("ПоВесу", Ложь);
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СтруктураВозврата.Цена = ВыборкаДетальныеЗаписи.Цена;
		СтруктураВозврата.ПоВесу = ВыборкаДетальныеЗаписи.ПоВесу;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыТоваровБезДопРасходовСрезПоследних.ВидТовара,
		|	ВидыТоваровБезДопРасходовСрезПоследних.Исключать
		|ИЗ
		|	РегистрСведений.ВидыТоваровБезДопРасходов.СрезПоследних(&Дата, Склад = &Склад) КАК ВидыТоваровБезДопРасходовСрезПоследних
		|ГДЕ
		|	ВидыТоваровБезДопРасходовСрезПоследних.ВидТовара = &ВидТовара";

	Запрос.УстановитьПараметр("Дата", ДанныеОбъекта.Дата);
	Запрос.УстановитьПараметр("Склад", ДанныеОбъекта.Склад);
	Запрос.УстановитьПараметр("ВидТовара", ДанныеОбъекта.ВидТовара);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Если  ВыборкаДетальныеЗаписи.Исключать Тогда
			СтруктураВозврата.Цена = 0;
			СтруктураВозврата.ПоВесу = Ложь;
		КонецЕсли;	
	КонецЦикла;

	Возврат  СтруктураВозврата;
	
КонецФункции	

Функция ПолучитьСтруктуруПараметровРасчетаБренд(ДанныеДляРасчета, ВыборкаДетальныеЗаписи)
	
	СтруктуруПараметров = Новый Структура;
	СтруктуруПараметров.Вставить("Авиа", ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный);
	СтруктуруПараметров.Вставить("ОбщийВес", ДанныеДляРасчета.ОбщийВес);
	СтруктуруПараметров.Вставить("ОбщийОбъем", ДанныеДляРасчета.ОбщийОбъем);
	СтруктуруПараметров.Вставить("Дата", ДанныеДляРасчета.Дата);
	СтруктуруПараметров.Вставить("ЦенаБренд", ВыборкаДетальныеЗаписи.ЦенаБренд);
	СтруктуруПараметров.Вставить("ЦенаБрендАвиа", ВыборкаДетальныеЗаписи.ЦенаБрендАвиа);
	
	Возврат СтруктуруПараметров;
	
КонецФункции	

Функция ПолучитьСтруктуруПараметровРасчетаZ(ДанныеДляРасчета, ВыборкаДетальныеЗаписи)
	
	СтруктуруПараметров = Новый Структура;
	СтруктуруПараметров.Вставить("Авиа", ДанныеДляРасчета.ВидОперации = Перечисления.тп_ВидОперацииПриемТовара.ПриемПочтыСтационарный);
	СтруктуруПараметров.Вставить("ОбщийВес", ДанныеДляРасчета.ОбщийВес);
	СтруктуруПараметров.Вставить("ОбщийОбъем", ДанныеДляРасчета.ОбщийОбъем);
	СтруктуруПараметров.Вставить("Дата", ДанныеДляРасчета.Дата);
	СтруктуруПараметров.Вставить("ЦенаZ", ВыборкаДетальныеЗаписи.ЦенаZ);
	
	Возврат СтруктуруПараметров;
	
КонецФункции	

Функция ПолучитьСуммуБренд(СтруктураПараметров)
	
	Если СтруктураПараметров.Дата >= Дата(2021,4,20)  Тогда
		ВариантРасчета  = 1; // По регистру цен
	Иначе
		ВариантРасчета  = 0; // По регистру тп_НаценкаЗаБренд
	КонецЕсли;	
	
	СуммаБренд = 0;
	Если ВариантРасчета  = 0 Тогда
		Если СтруктураПараметров.Авиа Тогда  // Только если авиа 
			НаценкаЗаБренд = тп_Служебный.ПолучитьНаценкуЗаБренд(СтруктураПараметров.Дата);
			СуммаБренд	= СтруктураПараметров.ОбщийВес * НаценкаЗаБренд.НаценкаЗаКг;
		КонецЕсли;
	КонецЕсли;
	
	Если  ВариантРасчета  = 1 Тогда
		Если СтруктураПараметров.Авиа Тогда  // Только если авиа 
			СуммаБренд	= СтруктураПараметров.ОбщийВес * СтруктураПараметров.ЦенаБрендАвиа;
		Иначе
			СуммаБренд	= СтруктураПараметров.ОбщийОбъем * СтруктураПараметров.ЦенаБренд;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат СуммаБренд;
	
	
КонецФункции	

Функция ПолучитьСуммуZ(СтруктураПараметров)
	
	ВариантРасчета  = 1; // По регистру цен
	
	СуммаZ = 0;
	Если  ВариантРасчета  = 1 Тогда
		СуммаZ	= СтруктураПараметров.ОбщийОбъем * СтруктураПараметров.ЦенаZ;
	КонецЕсли;	
	
	Возврат СуммаZ;
	
	
КонецФункции	

Функция ПолучитьНастройкиРасчетаШК(ДатаНастроек)  Экспорт
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//ПривилегированныйРежим();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тп_НастройкиРасчетаШКСрезПоследних.Период КАК ДатаУстановки,
		|	тп_НастройкиРасчетаШКСрезПоследних.ОбычныеЦеныДляВсехПриемок КАК ОбычныеЦеныДляВсехПриемок,
		|	тп_НастройкиРасчетаШКСрезПоследних.ОтключитьБренд КАК ОтключитьБренд,
		|	тп_НастройкиРасчетаШКСрезПоследних.ОтключитьZТовар КАК ОтключитьZТовар,
		|	тп_НастройкиРасчетаШКСрезПоследних.ОтключитьПроверкиКодовКлиентов КАК ОтключитьПроверкиКодовКлиентов,
		|	тп_НастройкиРасчетаШКСрезПоследних.РасчетАвиа КАК РасчетАвиа,
		|	тп_НастройкиРасчетаШКСрезПоследних.РасчетБренд КАК РасчетБренд,
		|	тп_НастройкиРасчетаШКСрезПоследних.РасчетZТовар КАК РасчетZТовар,
		|	тп_НастройкиРасчетаШКСрезПоследних.РасчетЭкспресс КАК РасчетЭкспресс,
		|	тп_НастройкиРасчетаШКСрезПоследних.РасчетДорогогоТовара КАК РасчетДорогогоТовара
		|ИЗ
		|	РегистрСведений.тп_НастройкиРасчетаШК.СрезПоследних(&ДатаНастроек, ) КАК тп_НастройкиРасчетаШКСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаНастроек", ДатаНастроек);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ДатаУстановки", Дата(2021,1,1));
	СтруктураВозврата.Вставить("ОбычныеЦеныДляВсехПриемок", Ложь);
	СтруктураВозврата.Вставить("ОтключитьБренд", Ложь);
	СтруктураВозврата.Вставить("ОтключитьZТовар", Ложь);
	СтруктураВозврата.Вставить("ОтключитьПроверкиКодовКлиентов", Ложь);
	СтруктураВозврата.Вставить("РасчетАвиа", Ложь);
	СтруктураВозврата.Вставить("РасчетБренд", Ложь);
	СтруктураВозврата.Вставить("РасчетZТовар", Ложь);
	СтруктураВозврата.Вставить("РасчетЭкспресс", Ложь);
	СтруктураВозврата.Вставить("РасчетДорогогоТовара", Ложь);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВозврата.ДатаУстановки = ВыборкаДетальныеЗаписи.ДатаУстановки;
		СтруктураВозврата.ОбычныеЦеныДляВсехПриемок = ВыборкаДетальныеЗаписи.ОбычныеЦеныДляВсехПриемок;
		СтруктураВозврата.ОтключитьБренд = ВыборкаДетальныеЗаписи.ОтключитьБренд;
		СтруктураВозврата.ОтключитьZТовар = ВыборкаДетальныеЗаписи.ОтключитьZТовар;
		СтруктураВозврата.ОтключитьПроверкиКодовКлиентов = ВыборкаДетальныеЗаписи.ОтключитьПроверкиКодовКлиентов;
		
		СтруктураВозврата.РасчетАвиа = ВыборкаДетальныеЗаписи.РасчетАвиа;
		СтруктураВозврата.РасчетБренд = ВыборкаДетальныеЗаписи.РасчетБренд;
		СтруктураВозврата.РасчетZТовар = ВыборкаДетальныеЗаписи.РасчетZТовар;
		СтруктураВозврата.РасчетЭкспресс = ВыборкаДетальныеЗаписи.РасчетЭкспресс;
		СтруктураВозврата.РасчетДорогогоТовара = ВыборкаДетальныеЗаписи.РасчетДорогогоТовара;
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции	

Функция ЕстьЦеныДляСклада(Склад)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тп_УстановкаФиксированныхЦенПоВесу.Ссылка КАК Ссылка,
		|	тп_УстановкаФиксированныхЦенПоВесу.Склад КАК Склад
		|ИЗ
		|	Документ.тп_УстановкаФиксированныхЦенПоВесу КАК тп_УстановкаФиксированныхЦенПоВесу
		|ГДЕ
		|	тп_УстановкаФиксированныхЦенПоВесу.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗначениеВозврата = Ложь;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ЗначениеВозврата = Истина;
	КонецЕсли;
	Возврат ЗначениеВозврата;
КонецФункции	

Функция ПолучитьЦеныДляКлиента(ДанныеДляРасчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Приоритет,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Цена КАК Цена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЭкспрессЦена КАК ЭкспрессЦена,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ПоВесу КАК ПоВесу,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаАвиа КАК ЦенаАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.АвиаПоОбъему КАК АвиаПоОбъему,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБренд КАК ЦенаБренд,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаZ КАК ЦенаZ,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ЦенаБрендАвиа КАК ЦенаБрендАвиа,
		|	ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Период КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.тп_Склады.ПустаяССылка) КАК Склад
		|ИЗ
		|	РегистрСведений.ЦеныНаГрузДляКлиентовПоВидамТоваров.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И видТовара = &ВидТовара
		|				И ТипУпаковки = &ТипУпаковки) КАК ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесОт И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ВесДо
		|	И ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.Используется = ИСТИНА
		|	И &Период МЕЖДУ ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаНачала И КОНЕЦПЕРИОДА(ЦеныНаГрузДляКлиентовПоВидамТоваровСрезПоследних.ДатаОкончания, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("ВидТовара", ДанныеДляРасчета.ВидТовара);
	Запрос.УстановитьПараметр("Клиент", ДанныеДляРасчета.Клиент);
	Запрос.УстановитьПараметр("Период", ДанныеДляРасчета.Дата);
	Запрос.УстановитьПараметр("СреднийВес", ДанныеДляРасчета.СреднийВес);
	Запрос.УстановитьПараметр("ТипУпаковки", ДанныеДляРасчета.ТипУпаковки);      
	
	Попытка
		Клиент = ДанныеДляРасчета.Клиент;
	Исключение
		Клиент = Справочники.тп_Клиенты.ПустаяСсылка();
	КонецПопытки;	

	Запрос.УстановитьПараметр("Клиент",	Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	СтруктураВозврата = Новый Структура("Цена, ЭкспрессЦена, ПоВесу, ЦенаАвиа, АвиаПоОбъему, ЦенаБренд, ЦенаZ, ЦенаБрендАвиа");
	СтруктураВозврата.Вставить("ЦенаУстановлена", Ложь);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаДетальныеЗаписи); 
		СтруктураВозврата.ЦенаУстановлена = Истина;
	КонецЦикла;
	
    Возврат СтруктураВозврата; 
	
КонецФункции	

Функция ПолучитьЦеныПоНовому(ДанныеДляРасчета) 
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ЦенаНаПеревозкуУстановлена", Ложь);
	СтруктураВозврата.Вставить("ЦенаНаРастаможкуУстановлена", Ложь);
	СтруктураВозврата.Вставить("НаценкиУстановлены", Ложь);

	// Растаможка цены
	ПолучитьЦеныНаРастаможку(ДанныеДляРасчета, СтруктураВозврата);
	
	// Перевозки цены
	ПолучитьТарифыНаПеревозку(ДанныеДляРасчета, СтруктураВозврата);

	// Наценки цены
	ПолучитьНаценкиНаТовар(ДанныеДляРасчета, СтруктураВозврата);
	
    Возврат СтруктураВозврата; 
	
КонецФункции	

Процедура ПолучитьТарифыНаПеревозку(ДанныеДляРасчета, СтруктураТарифов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тп_ТарифыНаПеревозкуСрезПоследних.Период КАК Период,
		|	тп_ТарифыНаПеревозкуСрезПоследних.Регистратор КАК Регистратор,
		|	тп_ТарифыНаПеревозкуСрезПоследних.ВидТарифа КАК ВидТарифа,
		|	тп_ТарифыНаПеревозкуСрезПоследних.ГородОтправки КАК ГородОтправки,
		|	тп_ТарифыНаПеревозкуСрезПоследних.ВесОт КАК ВесОт,
		|	тп_ТарифыНаПеревозкуСрезПоследних.ВесДо КАК ВесДо,
		|	тп_ТарифыНаПеревозкуСрезПоследних.Цена КАК Цена,
		|	тп_ТарифыНаПеревозкуСрезПоследних.ПоВесу КАК ПоВесу
		|ИЗ
		|	РегистрСведений.тп_ТарифыНаПеревозку.СрезПоследних(
		|			&ДатаСреза,
		|			ВидТарифа = &ВидТарифаНаПеревозку
		|				И ГородОтправки = &ГородОтправки) КАК тп_ТарифыНаПеревозкуСрезПоследних
		|ГДЕ
		|	&СреднийВес МЕЖДУ тп_ТарифыНаПеревозкуСрезПоследних.ВесОт И тп_ТарифыНаПеревозкуСрезПоследних.ВесДо";
	
	Запрос.УстановитьПараметр("СреднийВес", ДанныеДляРасчета.СреднийВес);
	Запрос.УстановитьПараметр("ДатаСреза", ДанныеДляРасчета.Дата); 
	Запрос.УстановитьПараметр("ВидТарифаНаПеревозку", ДанныеДляРасчета.ВидТарифаНаПеревозку); 
	Запрос.УстановитьПараметр("ГородОтправки", ДанныеДляРасчета.Склад.Город); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураЦены = Новый Структура();
		СтруктураЦены.Вставить("ГородОтправки", ВыборкаДетальныеЗаписи.ГородОтправки);
		СтруктураЦены.Вставить("Цена", ВыборкаДетальныеЗаписи.Цена);
		СтруктураЦены.Вставить("ПоВесу", ВыборкаДетальныеЗаписи.ПоВесу); 
		СтруктураЦены.Вставить("Регистратор", ВыборкаДетальныеЗаписи.Регистратор);   
		
		СтруктураТарифов.Вставить("ТарифНаПеревозку", СтруктураЦены);
		
		СтруктураТарифов.ЦенаНаПеревозкуУстановлена = Истина;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПолучитьЦеныНаРастаможку(ДанныеДляРасчета, СтруктураТарифов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тп_ЦеныНаРастаможкуСрезПоследних.Цена КАК Цена,
		|	тп_ЦеныНаРастаможкуСрезПоследних.ПоВесу КАК ПоВесу,
		|	тп_ЦеныНаРастаможкуСрезПоследних.ПоКоличеству КАК ПоКоличеству,
		|	тп_ЦеныНаРастаможкуСрезПоследних.ЛогистикаВключена КАК ЛогистикаВключена,
		|	тп_ЦеныНаРастаможкуСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.тп_ЦеныНаРастаможку.СрезПоследних(&ДатаСреза, ВидТовара = &ВидТовара) КАК тп_ЦеныНаРастаможкуСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидТовара", ДанныеДляРасчета.ВидТовара);
	Запрос.УстановитьПараметр("ДатаСреза", ДанныеДляРасчета.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураЦены = Новый Структура();
		СтруктураЦены.Вставить("Цена", ВыборкаДетальныеЗаписи.Цена);
		СтруктураЦены.Вставить("ПоВесу", ВыборкаДетальныеЗаписи.ПоВесу);   
		СтруктураЦены.Вставить("ПоКоличеству", ВыборкаДетальныеЗаписи.ПоКоличеству);   
		СтруктураЦены.Вставить("Регистратор", ВыборкаДетальныеЗаписи.Регистратор);   
		
		СтруктураТарифов.Вставить("ЦенаНаРастаможку", СтруктураЦены);
		СтруктураТарифов.Вставить("ЛогистикаВключена", ВыборкаДетальныеЗаписи.ЛогистикаВключена);
		СтруктураТарифов.ЦенаНаРастаможкуУстановлена = Истина;
	КонецЦикла;
	
КонецПроцедуры	     

Процедура ПолучитьНаценкиНаТовар(ДанныеДляРасчета, СтруктураТарифов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тп_НаценкиНаТоварСрезПоследних.ВидНаценки КАК ВидНаценки,
		|	тп_НаценкиНаТоварСрезПоследних.Наценка КАК Наценка
		|ИЗ
		|	РегистрСведений.тп_НаценкиНаТовар.СрезПоследних(&ДатаСреза, ) КАК тп_НаценкиНаТоварСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДанныеДляРасчета.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
           
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		СтруктураТарифов.Вставить("НаценкиНаТовар", ТЗ);
		СтруктураТарифов.НаценкиУстановлены = Истина;
	КонецЕсли;	
	
КонецПроцедуры	

Процедура РаспределитьСуммыПоТоварам(ДанныеДляРасчета, ЭтоКалькуляция = Ложь, ЗаполнятьТоварыПриКалькуляции)
	// Распределение сумм

	Если НЕ ЭтоКалькуляция Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары.Выгрузить();
		Если ДанныеДляРасчета.ПоВесу Тогда
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
			ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
		Иначе	
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
			ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
		КонецЕсли;	

		МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);

		ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
				
		Если ДанныеДляРасчета.СуммаБренд <> 0 Тогда
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
			МассивСуммБренд = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаБренд, МассивКоэф, 2);
			ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммБренд, "СуммаБренд");
		КонецЕсли;
				
		Если ДанныеДляРасчета.СуммаZ <> 0 Тогда
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
			МассивСуммZ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаZ, МассивКоэф, 2);
			ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммZ, "СуммаZ");
		КонецЕсли;
				
		ДанныеДляРасчета.Товары.Загрузить(ТаблицаТоваров);
	ИначеЕсли ЗаполнятьТоварыПриКалькуляции Тогда
		ТаблицаТоваров = ДанныеДляРасчета.Товары;
		Если ДанныеДляРасчета.ПоВесу Тогда
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Вес");	
			ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаТонну, "Цена");
		Иначе	
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Объем");	
			ТаблицаТоваров.ЗаполнитьЗначения(ДанныеДляРасчета.ЦенаЗаКуб, "Цена");
		КонецЕсли;	
		МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.Сумма, МассивКоэф, 2);
				
		ТаблицаТоваров.ЗагрузитьКолонку(МассивСумм, "Сумма");
				
		Если ДанныеДляРасчета.СуммаБренд <> 0 Тогда
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
			МассивСуммБренд = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаБренд, МассивКоэф, 2);
			ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммБренд, "СуммаБренд");
		КонецЕсли;
		
		Если ДанныеДляРасчета.СуммаZ <> 0 Тогда
			МассивКоэф = ТаблицаТоваров.ВыгрузитьКолонку("Сумма");	
			МассивСуммZ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ДанныеДляРасчета.СуммаZ, МассивКоэф, 2);
			ТаблицаТоваров.ЗагрузитьКолонку(МассивСуммZ, "СуммаZ");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	  

Функция ПолучитьВидТарифаПеревозок(ВидОперации) Экспорт

	ВидТарифа = Справочники.тп_ВидыТарифовНаПеревозку.НайтиПоРеквизиту("ТипПриема", ВидОперации);

	Возврат ВидТарифа;
	
КонецФункции	
	
Функция ПолучитьСтруктуруНовойЦены(ПриемСсылка) Экспорт 
	
	ДанныеДляРасчета = Документы.тп_ПриемТовара.ПолучитьСтруктуруРасчетаПриема(ПриемСсылка);
	Если ЗначениеЗаполнено(ДанныеДляРасчета.ОбщийОбъем) Тогда
		ДанныеДляРасчета.СреднийВес	= Окр(ДанныеДляРасчета.ОбщийВес / ДанныеДляРасчета.ОбщийОбъем,2);
	КонецЕсли;	
	Попытка
		ДанныеДляРасчета.ВидТарифаНаПеревозку = ПолучитьВидТарифаПеревозок(ДанныеДляРасчета.ВидОперации); 
	Исключение
	КонецПопытки;	
	
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ЦенаНаПеревозкуУстановлена", Ложь);
	СтруктураВозврата.Вставить("ЦенаНаРастаможкуУстановлена", Ложь);
	СтруктураВозврата.Вставить("НаценкиУстановлены", Ложь);

	// Растаможка цены
	ПолучитьЦеныНаРастаможку(ДанныеДляРасчета, СтруктураВозврата);
	
	// Перевозки цены
	ПолучитьТарифыНаПеревозку(ДанныеДляРасчета, СтруктураВозврата);

    Возврат СтруктураВозврата; 
	
КонецФункции	
